class UncleEngineer:
    '''
    test = UncleEngineer()
    test.art()
    '''
    def __init__(self):
        self.name = 'Uncle Engineer'

    def art(self):
        asciiart = '''
                             Z             
                       Z                   
        .,.,        z           
      (((((())    z             
     ((('_  _`) '               
     ((G   \ |)                 
    (((`   " ,                  
     .((\.:~:          .--------------.    
     __.| `"'.__      | \              |     
  .~~   `---'   ~.    |  .             :     
 /                `   |   `-.__________)     
|             ~       |  :             :   
|                     |  :  |              
|    _                |     |   [ ##   :   
 \    ~~-.            |  ,   oo_______.'   
  `_   ( \) _____/~~~~ `--___              
  | ~`-)  ) `-.   `---   ( - a:f -         
  |   '///`  | `-.                         
  |     | |  |    `-.                      
  |     | |  |       `-.                   
  |     | |\ |                             
  |     | | \|                             
   `-.  | |  |                             
      `-| '
        '''
        print(asciiart)
        
    def __str__(self):
        return self.name
    
class Suparatna:
    '''
    test = Suparatna()
    test.art()
    '''
    def __init__(self):
        self.name = 'Suparat'

    def art(self):
        asciiart = '''
        """""    "" , \_.   "_. ."
        ,., _"__ \__./ ."
       MMMMM_"  "_    ./
        ''''      (    )
 ._______________.-'____"---._.
  \                          /
   \________________________/
   (_)                    (_)
        '''
        print(asciiart)
        
    def __str__(self):
        return self.name

class Heart999:
    '''
    test = Heart999()
    test.art()
    '''
    def __init__(self):
        self.name = 'Heart'

    def art(self):
        asciiart = '''
……..@*@*
….@*……..@* …………………………@*
..@*……………@* ………………@*……..@*
.@*……………….@*……….@*……………..@*
@*…………………..@*…@*………………….@*
@*………………………*……………………..@*
.@*…………………………………………….@*
..@*………………………………………..@*
….@*…………………………………..@*
……..@*…………………………..@*
………..@*……………………@*
…………….@*…………..@*
……………….@*……@*
………………….*..@*
……………………@
……………………*
……………………@
……………………*
        '''
        print(asciiart)
        
    def __str__(self):
        return self.name

class House999:
    '''
    test = House999()
    test.art()
    '''
    def __init__(self):
        self.name = 'House'

    def art(self):
        asciiart = '''
    
        
∵*.•´¸.•*´✶´♡
° ☆ ° ˛*˛☆_Π______˚☆
*˚ ˛★˛•*/________/ ~ ⧹。˚ ˚
˚ ˛•˛•˚  ｜ 田田 ｜門｜ ˚
🌷╬╬🌷╬╬🌷╬╬🌷╬╬🌷
        '''
        print(asciiart)
        
    def __str__(self):
        return self.name

        
